Revit 2024 API
RebarShapeConstraintRadius Members
The RebarShapeConstraintRadius type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintRadius
 Create a radius constraint.
Methods
Name | Description
Dispose |  (Inherited from RebarShapeConstraint.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParamId
 Return the Id of the parameter associated with this constraint.
 (Inherited from RebarShapeConstraint.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ArcReferenceType
 The choice of rule for measuring the radius.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraintRadius Class
Autodesk.Revit.DB.Structure Namespace